tutorials/incompressible/simpleSolver/laminar/ACCM_flatPlate2D/0/p
/*---------------------------------------------------------------------------*\
Caelus 9.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      	[0 2 -2 0 0 0 0];

internalField   	uniform 0;

boundaryField
{
    downstream
    {
        type            zeroGradient;
    }
    inflow
    {
        type            zeroGradient;
    }
    outflow
    {
        type            fixedValue;
        value           uniform 0;
    }
    symm-left
    {
        type            empty;
    }
    symm-right
    {
        type            empty;
    }
    top
    {
        type            slip;
    }
    upstream
    {
        type            slip;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
