tutorials/incompressible/simpleSolver/laminar/ACCM_flatPlate2D/system/fvSolution
/*-------------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
        version                         2.0;
        format                          ascii;
        class                           dictionary;
        location                        "system";
        object                          fvSolution;
}

//------------------------------------------------------------------------------

solvers
{
        p
        {
            solver          PCG;
            preconditioner
            {
                	preconditioner  		GAMG;
                	smoother        		SSGS;
	                cacheAgglomeration 		true;
        	        nCellsInCoarsestLevel 		10;
                	agglomerator    		algebraicPair;
                	mergeLevels     		1;
            }
            tolerance       1e-08;
            relTol          0.01;
            maxIter         500;
        }
        U
        {
                solver                  PBiCGStab;
                preconditioner          USGS;
                tolerance               1e-7;
                relTol                  0.1;
        }

}

SIMPLE
{
        nNonOrthogonalCorrectors        0;
        pRefCell                        0;
        pRefValue                       0;
        consistent  true;
}

// relexation factors

relaxationFactors
{
        p                               1.0;
        U                               0.7;
}
